package com.noce.spark.vistorflow

import org.apache.spark.{SparkConf, SparkContext}
import org.apache.spark.SparkContext._
import org.apache.spark.sql.hive.HiveContext
import org.apache.spark.sql.functions._
import org.apache.spark.sql.types._
import org.apache.spark.sql.Row
import org.apache.log4j.Level
import org.apache.log4j.Logger
import java.util.Properties
import scala.collection.Seq

object MakeFake {

  def main(args: Array[String]): Unit = {
    Logger.getLogger("org.apache.spark").setLevel(Level.ERROR);
    Logger.getLogger("org.eclipse.jetty.server").setLevel(Level.ERROR);

    val conf = new SparkConf().setAppName("MakeFake")
    val sc = new SparkContext(conf)
    val hiveContext = new HiveContext(sc)
    import hiveContext.implicits._
    import hiveContext._


    val schema = StructType(List(
        StructField("city_id", IntegerType, nullable=false),
        StructField("district_id", IntegerType, nullable=false),
        StructField("district_name", StringType, nullable=false),
        StructField("base_statn_id", IntegerType, nullable=false),
        StructField("base_statn_name", StringType, nullable=false),
        StructField("sector_id", IntegerType, nullable=false),
        StructField("sector_name", StringType, nullable=false),
        StructField("center_longitude_baidu", DoubleType, nullable=false),
        StructField("center_latitude_baidu", DoubleType, nullable=false),
        StructField("flow_rate", IntegerType, nullable=false)
    ))

    val rdd = sc.parallelize(Seq(
      Row(200,1001,"长隆",490,"钟村谢村-高危_节点-D-L",0,"钟村谢村-高危_节点-D-L_0",113.308,22.9901,1),
      Row(200,1001,"长隆",490,"钟村谢村-高危_节点-D-L",1,"钟村谢村-高危_节点-D-L_1",113.308,22.9901,1),
      Row(200,1001,"长隆",494,"长隆动物-D",0,"长隆动物-D_0",113.329,23.0027,1),
      Row(200,1001,"长隆",494,"长隆动物-D",1,"长隆动物-D_1",113.329,23.0027,1),
      Row(200,1001,"长隆",494,"长隆动物-D",2,"长隆动物-D_2",113.329,23.0027,1),
      Row(200,1001,"长隆",494,"长隆动物-D",3,"长隆动物-D_3",113.325,23.0087,1),
      Row(200,1001,"长隆",516,"香江动物-D",0,"香江动物-D_0",113.306,23.0107,1),
      Row(200,1001,"长隆",516,"香江动物-D",1,"香江动物-D_1",113.306,23.0107,1),
      Row(200,1001,"长隆",516,"香江动物-D",2,"香江动物-D_2",113.306,23.0107,1),
      Row(200,1001,"长隆",548,"钟村飘峰-A-D",0,"钟村飘峰-A-D_0",113.3,22.9988,1),
      Row(200,1001,"长隆",548,"钟村飘峰-A-D",1,"钟村飘峰-A-D_1",113.3,22.9988,1),
      Row(200,1001,"长隆",660,"飘峰山庄-D",0,"飘峰山庄-D_0",113.303,23.0048,1),
      Row(200,1001,"长隆",660,"飘峰山庄-D",1,"飘峰山庄-D_1",113.303,23.0048,1),
      Row(200,1001,"长隆",660,"飘峰山庄-D",2,"飘峰山庄-D_2",113.303,23.0048,1),
      Row(200,1001,"长隆",672,"长隆酒店二期A1栋-A5栋-D",0,"长隆酒店二期A1栋-A5栋-D_0",113.321,23.0052,1),
      Row(200,1001,"长隆",672,"长隆酒店二期A1栋-A5栋-D",1,"长隆酒店二期A1栋-A5栋-D_1",113.321,23.0053,1),
      Row(200,1001,"长隆",672,"长隆酒店二期A1栋-A5栋-D",2,"长隆酒店二期A1栋-A5栋-D_2",113.322,23.005,1),
      Row(200,1001,"长隆",672,"长隆酒店二期A1栋-A5栋-D",3,"长隆酒店二期A1栋-A5栋-D_3",113.322,23.005,1),
      Row(200,1001,"长隆",699,"南奥果岭一号四座-D",3,"南奥果岭一号四座-D_3",113.316,22.9908,1),
      Row(200,1001,"长隆",732,"番禺香江动物园-D",0,"番禺香江动物园-D_0",113.312,23.0097,1),
      Row(200,1001,"长隆",732,"番禺香江动物园-D",1,"番禺香江动物园-D_1",113.312,23.0097,1),
      Row(200,1001,"长隆",732,"番禺香江动物园-D",2,"番禺香江动物园-D_2",113.312,23.0097,1),
      Row(200,1001,"长隆",1301,"钟村长隆欢乐世界-D",0,"钟村长隆欢乐世界-D_0",113.321,22.9978,1),
      Row(200,1001,"长隆",1301,"钟村长隆欢乐世界-D",1,"钟村长隆欢乐世界-D_1",113.321,22.9978,1),
      Row(200,1001,"长隆",1301,"钟村长隆欢乐世界-D",2,"钟村长隆欢乐世界-D_2",113.321,22.9978,1),
      Row(200,1001,"长隆",1467,"大石植村搬迁-D",1,"大石植村搬迁-D_1",113.323,23.0115,1),
      Row(200,1001,"长隆",1467,"大石植村搬迁-D",2,"大石植村搬迁-D_2",113.323,23.0115,1),
      Row(200,1001,"长隆",1467,"大石植村搬迁-D",3,"大石植村搬迁-D_3",113.322,23.005,1),
      Row(200,1001,"长隆",1468,"大石植村宇宙工业园-D",4,"大石植村宇宙工业园-D_4",113.328,23.005,1),
      Row(200,1001,"长隆",1469,"长隆水上世界-D",0,"长隆水上世界-D_0",113.318,23.0072,1),
      Row(200,1001,"长隆",1469,"长隆水上世界-D",1,"长隆水上世界-D_1",113.318,23.0072,1),
      Row(200,1001,"长隆",1469,"长隆水上世界-D",2,"长隆水上世界-D_2",113.318,23.0072,1),
      Row(200,1002,"体育中心",1917,"天河体育场西北-D",0,"天河体育场西北-D_0",113.318883,23.14121,1),
      Row(200,1002,"体育中心",1917,"天河体育场西北-D",1,"天河体育场西北-D_1",113.318883,23.14121,1),
      Row(200,1002,"体育中心",1917,"天河体育场西北-D",4,"天河体育场西北-D_4",113.32065,23.14045,1),
      Row(200,1002,"体育中心",1916,"天河体育场西南-D",0,"天河体育场西南-D_0",113.318712,23.139702,1),
      Row(200,1002,"体育中心",1916,"天河体育场西南-D",1,"天河体育场西南-D_1",113.318712,23.139702,1),
      Row(200,1002,"体育中心",1916,"天河体育场西南-D",4,"天河体育场西南-D_4",113.32065,23.14045,1),
      Row(200,1002,"体育中心",431,"天河体育场1F西南侧-D",0,"天河体育场1F西南侧-D_0",113.31682,23.13898,1),
      Row(200,1002,"体育中心",431,"天河体育场1F西南侧-D",1,"天河体育场1F西南侧-D_1",113.31682,23.13898,1),
      Row(200,1002,"体育中心",431,"天河体育场1F西南侧-D",2,"天河体育场1F西南侧-D_2",113.31682,23.13898,1),
      Row(200,1002,"体育中心",431,"天河体育场1F西南侧-D",3,"天河体育场1F西南侧-D_3",113.318,23.14054,1),
      Row(200,1002,"体育中心",204,"J天河体育场BBU1",0,"J天河体育场BBU1_0",113.319873,23.140813,1),
      Row(200,1002,"体育中心",204,"J天河体育场BBU1",1,"J天河体育场BBU1_1",113.319873,23.140813,1),
      Row(200,1002,"体育中心",204,"J天河体育场BBU1",2,"J天河体育场BBU1_2",113.319873,23.140813,1),
      Row(200,1002,"体育中心",432,"天河体育场微基站-D",1,"天河体育场微基站-D_1",113.31682,23.13898,1),
      Row(200,1002,"体育中心",432,"天河体育场微基站-D",2,"天河体育场微基站-D_2",113.31682,23.13898,1),
      Row(200,1002,"体育中心",432,"天河体育场微基站-D",3,"天河体育场微基站-D_3",113.31682,23.13898,1),
      Row(200,1002,"体育中心",276,"天河体育场2F-3F东区-D",0,"天河体育场2F-3F东区-D_0",113.31682,23.13898,1),
      Row(200,1002,"体育中心",276,"天河体育场2F-3F东区-D",1,"天河体育场2F-3F东区-D_1",113.31682,23.13898,1),
      Row(200,1002,"体育中心",276,"天河体育场2F-3F东区-D",2,"天河体育场2F-3F东区-D_2",113.31682,23.13898,1),
      Row(200,1002,"体育中心",1904,"天河北-D",0,"天河北-D_0",113.316159,23.144095,1),
      Row(200,1002,"体育中心",1904,"天河北-D",1,"天河北-D_1",113.316159,23.144095,1),
      Row(200,1002,"体育中心",153,"天河华普2-D",4,"天河华普2-D_4",113.31616,23.1363,1),
      Row(200,1002,"体育中心",30,"体育中心搬迁-D",0,"体育中心搬迁-D_0",113.32186,23.13534,1),
      Row(200,1002,"体育中心",30,"体育中心搬迁-D",1,"体育中心搬迁-D_1",113.32186,23.13534,1),
      Row(200,1002,"体育中心",30,"体育中心搬迁-D",2,"体育中心搬迁-D_2",113.32186,23.13534,1),
      Row(200,1002,"体育中心",281,"体育西-Y-D",0,"体育西-Y-D_0",113.314581,23.137831,1),
      Row(200,1002,"体育中心",50,"中信广场6F-A-D-VIP",0,"中信广场6F-A-D-VIP_0",113.3196528,23.1442361,1),
      Row(200,1002,"体育中心",50,"中信广场6F-A-D-VIP",1,"中信广场6F-A-D-VIP_1",113.3196528,23.1442361,1),
      Row(200,1002,"体育中心",290,"都市华庭-D-VIP",2,"都市华庭-D-VIP_2",113.324,23.143524,1),
      Row(200,1002,"体育中心",243,"电信大厦-D-VIP",3,"电信大厦-D-VIP_3",113.324097,23.140205,1),
      Row(200,1002,"体育中心",243,"电信大厦-D-VIP",4,"电信大厦-D-VIP_4",113.3235,23.14053,1),
      Row(200,1002,"体育中心",261,"体育东路-Y-D-VIP",0,"体育东路-Y-D-VIP_0",113.324124,23.1402083,1),
      Row(200,1002,"体育中心",261,"体育东路-Y-D-VIP",1,"体育东路-Y-D-VIP_1",113.324124,23.1402083,1),
      Row(200,1003,"琶洲会展",23,"会展中心3-A-D-L",0,"会展中心3-A-D-L_0",113.3554167,23.104375,1),
      Row(200,1003,"琶洲会展",23,"会展中心3-A-D-L",1,"会展中心3-A-D-L_1",113.3554167,23.104375,1),
      Row(200,1003,"琶洲会展",23,"会展中心3-A-D-L",2,"会展中心3-A-D-L_2",113.3554167,23.104375,1),
      Row(200,1003,"琶洲会展",24,"会展中心4-A-D",0,"会展中心4-A-D_0",113.3564583,23.1044444,1),
      Row(200,1003,"琶洲会展",24,"会展中心4-A-D",1,"会展中心4-A-D_1",113.3564583,23.1044444,1),
      Row(200,1003,"琶洲会展",24,"会展中心4-A-D",2,"会展中心4-A-D_2",113.3564583,23.1044444,1),
      Row(200,1003,"琶洲会展",25,"会展中心5-A-D-L",0,"会展中心5-A-D-L_0",113.3536111,23.1045139,1),
      Row(200,1003,"琶洲会展",25,"会展中心5-A-D-L",1,"会展中心5-A-D-L_1",113.3536111,23.1045139,1),
      Row(200,1003,"琶洲会展",25,"会展中心5-A-D-L",2,"会展中心5-A-D-L_2",113.3536111,23.1045139,1),
      Row(200,1003,"琶洲会展",27,"会展中心1-A-D",0,"会展中心1-A-D_0",113.35375,23.104375,1),
      Row(200,1003,"琶洲会展",27,"会展中心1-A-D",1,"会展中心1-A-D_1",113.35375,23.104375,1),
      Row(200,1003,"琶洲会展",27,"会展中心1-A-D",2,"会展中心1-A-D_2",113.35375,23.104375,1),
      Row(200,1003,"琶洲会展",31,"会展中心2-节点A-D-L",0,"会展中心2-节点A-D-L_0",113.3546528,23.1045139,1),
      Row(200,1003,"琶洲会展",31,"会展中心2-节点A-D-L",1,"会展中心2-节点A-D-L_1",113.3546528,23.1045139,1),
      Row(200,1003,"琶洲会展",31,"会展中心2-节点A-D-L",2,"会展中心2-节点A-D-L_2",113.3546528,23.1045139,1),
      Row(200,1003,"琶洲会展",35,"会展中心6-A-D",0,"会展中心6-A-D_0",113.3555556,23.1044444,1),
      Row(200,1003,"琶洲会展",35,"会展中心6-A-D",1,"会展中心6-A-D_1",113.3555556,23.1044444,1),
      Row(200,1003,"琶洲会展",35,"会展中心6-A-D",2,"会展中心6-A-D_2",113.3555556,23.1044444,1),
      Row(200,1003,"琶洲会展",121,"会展中心二期1-A-D",0,"会展中心二期1-A-D_0",113.3599306,23.104375,1),
      Row(200,1003,"琶洲会展",121,"会展中心二期1-A-D",1,"会展中心二期1-A-D_1",113.3599306,23.104375,1),
      Row(200,1003,"琶洲会展",121,"会展中心二期1-A-D",2,"会展中心二期1-A-D_2",113.3599306,23.104375,1),
      Row(200,1003,"琶洲会展",122,"会展中心二期2-A-D",0,"会展中心二期2-A-D_0",113.3599306,23.1042361,1),
      Row(200,1003,"琶洲会展",122,"会展中心二期2-A-D",1,"会展中心二期2-A-D_1",113.3599306,23.1042361,1),
      Row(200,1003,"琶洲会展",122,"会展中心二期2-A-D",2,"会展中心二期2-A-D_2",113.3599306,23.1042361,1),
      Row(200,1003,"琶洲会展",123,"会展中心二期3-A-D-L",0,"会展中心二期3-A-D-L_0",113.3609028,23.1041667,1),
      Row(200,1003,"琶洲会展",123,"会展中心二期3-A-D-L",1,"会展中心二期3-A-D-L_1",113.3609028,23.1041667,1),
      Row(200,1003,"琶洲会展",123,"会展中心二期3-A-D-L",2,"会展中心二期3-A-D-L_2",113.3609028,23.1041667,1),
      Row(200,1003,"琶洲会展",124,"会展中心二期4-A-D",0,"会展中心二期4-A-D_0",113.3598611,23.1052778,1),
      Row(200,1003,"琶洲会展",124,"会展中心二期4-A-D",1,"会展中心二期4-A-D_1",113.3598611,23.1052778,1),
      Row(200,1003,"琶洲会展",124,"会展中心二期4-A-D",2,"会展中心二期4-A-D_2",113.3598611,23.1052778,1),
      Row(200,1003,"琶洲会展",125,"会展中心二期5-A-D-L",0,"会展中心二期5-A-D-L_0",113.3598611,23.1052778,1),
      Row(200,1003,"琶洲会展",125,"会展中心二期5-A-D-L",1,"会展中心二期5-A-D-L_1",113.3598611,23.1052778,1),
      Row(200,1003,"琶洲会展",125,"会展中心二期5-A-D-L",2,"会展中心二期5-A-D-L_2",113.3598611,23.1052778,1),
      Row(200,1003,"琶洲会展",185,"会展中心南居民楼-D",0,"会展中心南居民楼-D_0",113.3570833,23.0965278,1),
      Row(200,1003,"琶洲会展",185,"会展中心南居民楼-D",1,"会展中心南居民楼-D_1",113.3570833,23.0965278,1),
      Row(200,1003,"琶洲会展",185,"会展中心南居民楼-D",2,"会展中心南居民楼-D_2",113.3570833,23.0965278,1),
      Row(200,1003,"琶洲会展",460,"琶洲会展中心三期南广场-D",0,"琶洲会展中心三期南广场-D_0",113.359434,23.100464,1),
      Row(200,1003,"琶洲会展",460,"琶洲会展中心三期南广场-D",1,"琶洲会展中心三期南广场-D_1",113.359434,23.100464,1),
      Row(200,1003,"琶洲会展",704,"N阅江路会展东搬迁",0,"N阅江路会展东搬迁_0",113.36554,23.10687,1),
      Row(200,1003,"琶洲会展",705,"阅江路会展中-D",0,"阅江路会展中-D_0",113.35869,23.1069,1),
      Row(200,1003,"琶洲会展",708,"会展酒店地下室-D",0,"会展酒店地下室-D_0",113.35858,23.10462,1),
      Row(200,1003,"琶洲会展",708,"会展酒店地下室-D",1,"会展酒店地下室-D_1",113.35858,23.10462,1),
      Row(200,1003,"琶洲会展",708,"会展酒店地下室-D",2,"会展酒店地下室-D_2",113.35858,23.10462,1),
      Row(200,1003,"琶洲会展",708,"会展酒店地下室-D",3,"会展酒店地下室-D_3",113.35858,23.10462,1),
      Row(200,1003,"琶洲会展",710,"阅江路会展西-D",0,"阅江路会展西-D_0",113.34673,23.10785,1),
      Row(200,1003,"琶洲会展",710,"阅江路会展西-D",1,"阅江路会展西-D_1",113.34673,23.10785,1),
      Row(200,1003,"琶洲会展",136,"会展三期1",0,"会展三期1_0",113.3565278,23.1003472,1),
      Row(200,1003,"琶洲会展",136,"会展三期1",1,"会展三期1_1",113.3565278,23.1003472,1),
      Row(200,1003,"琶洲会展",136,"会展三期1",2,"会展三期1_2",113.3565278,23.1003472,1),
      Row(200,1003,"琶洲会展",137,"会展三期2",0,"会展三期2_0",113.3572917,23.1003472,1),
      Row(200,1003,"琶洲会展",137,"会展三期2",1,"会展三期2_1",113.3572917,23.1003472,1),
      Row(200,1003,"琶洲会展",137,"会展三期2",2,"会展三期2_2",113.3572917,23.1003472,1),
      Row(200,1003,"琶洲会展",138,"会展三期3",0,"会展三期3_0",113.3577778,23.1002778,1),
      Row(200,1003,"琶洲会展",139,"会展三期4",0,"会展三期4_0",113.3577778,23.1002778,1),
      Row(200,1003,"琶洲会展",139,"会展三期4",1,"会展三期4_1",113.3577778,23.1002778,1),
      Row(200,1003,"琶洲会展",139,"会展三期4",2,"会展三期4_2",113.3577778,23.1002778,1),
      Row(200,1003,"琶洲会展",460,"琶洲会展中心三期南广场-D",2,"琶洲会展中心三期南广场-D_2",113.359434,23.100464,1)
    ))
    val dfDimDistrictA = hiveContext.createDataFrame(rdd, schema)
    val df = dfDimDistrictA.withColumn("update_time", current_timestamp())

    // val dfWriter = df.write.mode("overwrite").format("parquest")
    // val dfWriter = df.write.mode("append")
    val dfWriter = df.write.mode("overwrite").format("ORC")
    dfWriter.saveAsTable("noce.DIM_DISTRICT_A")


    val prop = new Properties()
    prop.put("user", "noce")
    prop.put("password", "123456")
    prop.put("driver", "com.mysql.jdbc.Driver")

    // val url="jdbc:mysql://132.122.70.7:3306/noce"
    val url="jdbc:mysql://132.122.70.7:3306/noce?useUnicode=true&characterEncoding=utf8"
    dfWriter.jdbc(url, "DIM_DISTRICT_A", prop)

    sc.stop()

  }
}
